import axios from "axios";

// Для роботи з колекцією нотатків використовуйте готовий бекенд. 
// Документація до нього доступна за посиланням:

// https://notehub-public.goit.study/api/docs

// Щоб працювати з бекендом, вам потрібно отримати персональний ключ доступу 
// прив’язаний до вашої пошти. Це буде зручно зробити прямо в документації бекенда.

// Функції для виконання HTTP-запитів винесіть в окремий файл src/services/noteService.ts. 
// Типізуйте їх параметри, результат, який вони повертають, та відповідь від Axios. 
// У вас мають бути наступні функції:

// fetchNotes : має виконувати запит для отримання колекції нотатків із сервера. 
// Повинна підтримувати пагінацію (через параметр сторінки) та фільтрацію за ключовим словом (пошук);
// createNote: має виконувати запит для створення нової нотатки на сервері. 
// Приймає вміст нової нотатки та повертає створену нотатку у відповіді;
// deleteNote: має виконувати запит для видалення нотатки за заданим ідентифікатором. 
// Приймає ID нотатки та повертає інформацію про видалену нотатку у відповіді.