import { useState } from 'react'
import css from './App.module.css'

export default function App() {
  const [] = useState(0)

  return (
  <div className={css.app}>
	<header className={css.toolbar}>
		{/* Компонент SearchBox */}
		{/* Пагінація */}
		{  <button className={css.button}>Create note +</button>
/* Кнопка створення нотатки 
При натисканні на цю кнопку має відкриватись модальне вікно NoteModal з формою NoteForm. 
Компонент NoteModal має створювати DOM-елемент наступної структури:*/}
  </header>
</div>
  )
}

// Компонент App є контейнером для решти компонентів і поки що створює таку розмітку:


// В майбутному в хедері буде додаткова розмітка елементів пошуку, 
// пагінації та відкриття модального вікна для створення нотатки.

// Додатково



// Рекомендуємо створити окремі компоненти для відображення 
// індикатора завантаження під час виконання HTTP-запитів, 
// повідомлень про помилки та інших статусів запиту.
